mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2hexf/common/s6e2hexf.h
/*******************************************************************************
* MFT Registers MFT0
*   Bitband Section
*******************************************************************************/
#define bFM_MFT0_ADCMP_ACMC0_MZCE                 *((volatile  uint8_t *)(0x42403AD8UL))
#define bFM4_MFT0_ADCMP_ACMC0_MZCE                *((volatile  uint8_t *)(0x42403AD8UL))
#define bFM_MFT0_ADCMP_ACMC0_MPCE                 *((volatile  uint8_t *)(0x42403ADCUL))
#define bFM4_MFT0_ADCMP_ACMC0_MPCE                *((volatile  uint8_t *)(0x42403ADCUL))

#define bFM_MFT0_ADCMP_ACMC1_MZCE                 *((volatile  uint8_t *)(0x42403B58UL))
#define bFM4_MFT0_ADCMP_ACMC1_MZCE                *((volatile  uint8_t *)(0x42403B58UL))
#define bFM_MFT0_ADCMP_ACMC1_MPCE                 *((volatile  uint8_t *)(0x42403B5CUL))
#define bFM4_MFT0_ADCMP_ACMC1_MPCE                *((volatile  uint8_t *)(0x42403B5CUL))

#define bFM_MFT0_ADCMP_ACMC2_MZCE                 *((volatile  uint8_t *)(0x42403BD8UL))
#define bFM4_MFT0_ADCMP_ACMC2_MZCE                *((volatile  uint8_t *)(0x42403BD8UL))
#define bFM_MFT0_ADCMP_ACMC2_MPCE                 *((volatile  uint8_t *)(0x42403BDCUL))
#define bFM4_MFT0_ADCMP_ACMC2_MPCE                *((volatile  uint8_t *)(0x42403BDCUL))

#define bFM_MFT0_ADCMP_ACMC3_MZCE                 *((volatile  uint8_t *)(0x42403C58UL))
#define bFM4_MFT0_ADCMP_ACMC3_MZCE                *((volatile  uint8_t *)(0x42403C58UL))
#define bFM_MFT0_ADCMP_ACMC3_MPCE                 *((volatile  uint8_t *)(0x42403C5CUL))
#define bFM4_MFT0_ADCMP_ACMC3_MPCE                *((volatile  uint8_t *)(0x42403C5CUL))

#define bFM_MFT0_ADCMP_ACMC4_MZCE                 *((volatile  uint8_t *)(0x42403CD8UL))
#define bFM4_MFT0_ADCMP_ACMC4_MZCE                *((volatile  uint8_t *)(0x42403CD8UL))
#define bFM_MFT0_ADCMP_ACMC4_MPCE                 *((volatile  uint8_t *)(0x42403CDCUL))
#define bFM4_MFT0_ADCMP_ACMC4_MPCE                *((volatile  uint8_t *)(0x42403CDCUL))

#define bFM_MFT0_ADCMP_ACMC5_MZCE                 *((volatile  uint8_t *)(0x42403D58UL))
#define bFM4_MFT0_ADCMP_ACMC5_MZCE                *((volatile  uint8_t *)(0x42403D58UL))
#define bFM_MFT0_ADCMP_ACMC5_MPCE                 *((volatile  uint8_t *)(0x42403D5CUL))
#define bFM4_MFT0_ADCMP_ACMC5_MPCE                *((volatile  uint8_t *)(0x42403D5CUL))

#define bFM_MFT0_ADCMP_ACSC0_APBM                 *((volatile  uint8_t *)(0x42403A94UL))
#define bFM4_MFT0_ADCMP_ACSC0_APBM                *((volatile  uint8_t *)(0x42403A94UL))

#define bFM_MFT0_ADCMP_ACSC1_APBM                 *((volatile  uint8_t *)(0x42403B14UL))
#define bFM4_MFT0_ADCMP_ACSC1_APBM                *((volatile  uint8_t *)(0x42403B14UL))

#define bFM_MFT0_ADCMP_ACSC2_APBM                 *((volatile  uint8_t *)(0x42403B94UL))
#define bFM4_MFT0_ADCMP_ACSC2_APBM                *((volatile  uint8_t *)(0x42403B94UL))

#define bFM_MFT0_ADCMP_ACSC3_APBM                 *((volatile  uint8_t *)(0x42403C14UL))
#define bFM4_MFT0_ADCMP_ACSC3_APBM                *((volatile  uint8_t *)(0x42403C14UL))

#define bFM_MFT0_ADCMP_ACSC4_APBM                 *((volatile  uint8_t *)(0x42403C94UL))
#define bFM4_MFT0_ADCMP_ACSC4_APBM                *((volatile  uint8_t *)(0x42403C94UL))

#define bFM_MFT0_ADCMP_ACSC5_APBM                 *((volatile  uint8_t *)(0x42403D14UL))
#define bFM4_MFT0_ADCMP_ACSC5_APBM                *((volatile  uint8_t *)(0x42403D14UL))

#define bFM_MFT0_ADCMP_ACSD0_AMOD                 *((volatile  uint8_t *)(0x42403AA0UL))
#define bFM4_MFT0_ADCMP_ACSD0_AMOD                *((volatile  uint8_t *)(0x42403AA0UL))
#define bFM_MFT0_ADCMP_ACSD0_OCUS                 *((volatile  uint8_t *)(0x42403AA4UL))
#define bFM4_MFT0_ADCMP_ACSD0_OCUS                *((volatile  uint8_t *)(0x42403AA4UL))
#define bFM_MFT0_ADCMP_ACSD0_DE                   *((volatile  uint8_t *)(0x42403AB0UL))
#define bFM4_MFT0_ADCMP_ACSD0_DE                  *((volatile  uint8_t *)(0x42403AB0UL))
#define bFM_MFT0_ADCMP_ACSD0_PE                   *((volatile  uint8_t *)(0x42403AB4UL))
#define bFM4_MFT0_ADCMP_ACSD0_PE                  *((volatile  uint8_t *)(0x42403AB4UL))
#define bFM_MFT0_ADCMP_ACSD0_UE                   *((volatile  uint8_t *)(0x42403AB8UL))
#define bFM4_MFT0_ADCMP_ACSD0_UE                  *((volatile  uint8_t *)(0x42403AB8UL))
#define bFM_MFT0_ADCMP_ACSD0_ZE                   *((volatile  uint8_t *)(0x42403ABCUL))
#define bFM4_MFT0_ADCMP_ACSD0_ZE                  *((volatile  uint8_t *)(0x42403ABCUL))

#define bFM_MFT0_ADCMP_ACSD1_AMOD                 *((volatile  uint8_t *)(0x42403B20UL))
#define bFM4_MFT0_ADCMP_ACSD1_AMOD                *((volatile  uint8_t *)(0x42403B20UL))
#define bFM_MFT0_ADCMP_ACSD1_OCUS                 *((volatile  uint8_t *)(0x42403B24UL))
#define bFM4_MFT0_ADCMP_ACSD1_OCUS                *((volatile  uint8_t *)(0x42403B24UL))
#define bFM_MFT0_ADCMP_ACSD1_DE                   *((volatile  uint8_t *)(0x42403B30UL))
#define bFM4_MFT0_ADCMP_ACSD1_DE                  *((volatile  uint8_t *)(0x42403B30UL))
#define bFM_MFT0_ADCMP_ACSD1_PE                   *((volatile  uint8_t *)(0x42403B34UL))
#define bFM4_MFT0_ADCMP_ACSD1_PE                  *((volatile  uint8_t *)(0x42403B34UL))
#define bFM_MFT0_ADCMP_ACSD1_UE                   *((volatile  uint8_t *)(0x42403B38UL))
#define bFM4_MFT0_ADCMP_ACSD1_UE                  *((volatile  uint8_t *)(0x42403B38UL))
#define bFM_MFT0_ADCMP_ACSD1_ZE                   *((volatile  uint8_t *)(0x42403B3CUL))
#define bFM4_MFT0_ADCMP_ACSD1_ZE                  *((volatile  uint8_t *)(0x42403B3CUL))

#define bFM_MFT0_ADCMP_ACSD2_AMOD                 *((volatile  uint8_t *)(0x42403BA0UL))
#define bFM4_MFT0_ADCMP_ACSD2_AMOD                *((volatile  uint8_t *)(0x42403BA0UL))
#define bFM_MFT0_ADCMP_ACSD2_OCUS                 *((volatile  uint8_t *)(0x42403BA4UL))
#define bFM4_MFT0_ADCMP_ACSD2_OCUS                *((volatile  uint8_t *)(0x42403BA4UL))
#define bFM_MFT0_ADCMP_ACSD2_DE                   *((volatile  uint8_t *)(0x42403BB0UL))
#define bFM4_MFT0_ADCMP_ACSD2_DE                  *((volatile  uint8_t *)(0x42403BB0UL))
#define bFM_MFT0_ADCMP_ACSD2_PE                   *((volatile  uint8_t *)(0x42403BB4UL))
#define bFM4_MFT0_ADCMP_ACSD2_PE                  *((volatile  uint8_t *)(0x42403BB4UL))
#define bFM_MFT0_ADCMP_ACSD2_UE                   *((volatile  uint8_t *)(0x42403BB8UL))
#define bFM4_MFT0_ADCMP_ACSD2_UE                  *((volatile  uint8_t *)(0x42403BB8UL))
#define bFM_MFT0_ADCMP_ACSD2_ZE                   *((volatile  uint8_t *)(0x42403BBCUL))
#define bFM4_MFT0_ADCMP_ACSD2_ZE                  *((volatile  uint8_t *)(0x42403BBCUL))

