mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2hexf/common/s6e2hexf.h
#define bFM_MFT1_FRT_TCSA2_SCLR                   *((volatile  uint8_t *)(0x42422C10UL))
#define bFM4_MFT1_FRT_TCSA2_SCLR                  *((volatile  uint8_t *)(0x42422C10UL))
#define bFM_MFT1_FRT_TCSA2_MODE                   *((volatile  uint8_t *)(0x42422C14UL))
#define bFM4_MFT1_FRT_TCSA2_MODE                  *((volatile  uint8_t *)(0x42422C14UL))
#define bFM_MFT1_FRT_TCSA2_STOP                   *((volatile  uint8_t *)(0x42422C18UL))
#define bFM4_MFT1_FRT_TCSA2_STOP                  *((volatile  uint8_t *)(0x42422C18UL))
#define bFM_MFT1_FRT_TCSA2_BFE                    *((volatile  uint8_t *)(0x42422C1CUL))
#define bFM4_MFT1_FRT_TCSA2_BFE                   *((volatile  uint8_t *)(0x42422C1CUL))
#define bFM_MFT1_FRT_TCSA2_ICRE                   *((volatile  uint8_t *)(0x42422C20UL))
#define bFM4_MFT1_FRT_TCSA2_ICRE                  *((volatile  uint8_t *)(0x42422C20UL))
#define bFM_MFT1_FRT_TCSA2_ICLR                   *((volatile  uint8_t *)(0x42422C24UL))
#define bFM4_MFT1_FRT_TCSA2_ICLR                  *((volatile  uint8_t *)(0x42422C24UL))
#define bFM_MFT1_FRT_TCSA2_IRQZE                  *((volatile  uint8_t *)(0x42422C34UL))
#define bFM4_MFT1_FRT_TCSA2_IRQZE                 *((volatile  uint8_t *)(0x42422C34UL))
#define bFM_MFT1_FRT_TCSA2_IRQZF                  *((volatile  uint8_t *)(0x42422C38UL))
#define bFM4_MFT1_FRT_TCSA2_IRQZF                 *((volatile  uint8_t *)(0x42422C38UL))
#define bFM_MFT1_FRT_TCSA2_ECKE                   *((volatile  uint8_t *)(0x42422C3CUL))
#define bFM4_MFT1_FRT_TCSA2_ECKE                  *((volatile  uint8_t *)(0x42422C3CUL))

#define bFM_MFT1_FRT_TCSD_OFMD1                   *((volatile  uint8_t *)(0x42423D80UL))
#define bFM4_MFT1_FRT_TCSD_OFMD1                  *((volatile  uint8_t *)(0x42423D80UL))
#define bFM_MFT1_FRT_TCSD_OFMD2                   *((volatile  uint8_t *)(0x42423D84UL))
#define bFM4_MFT1_FRT_TCSD_OFMD2                  *((volatile  uint8_t *)(0x42423D84UL))

#define bFM_MFT1_ICU_ICSA10_ICE0                  *((volatile  uint8_t *)(0x42423090UL))
#define bFM4_MFT1_ICU_ICSA10_ICE0                 *((volatile  uint8_t *)(0x42423090UL))
#define bFM_MFT1_ICU_ICSA10_ICE1                  *((volatile  uint8_t *)(0x42423094UL))
#define bFM4_MFT1_ICU_ICSA10_ICE1                 *((volatile  uint8_t *)(0x42423094UL))
#define bFM_MFT1_ICU_ICSA10_ICP0                  *((volatile  uint8_t *)(0x42423098UL))
#define bFM4_MFT1_ICU_ICSA10_ICP0                 *((volatile  uint8_t *)(0x42423098UL))
#define bFM_MFT1_ICU_ICSA10_ICP1                  *((volatile  uint8_t *)(0x4242309CUL))
#define bFM4_MFT1_ICU_ICSA10_ICP1                 *((volatile  uint8_t *)(0x4242309CUL))

#define bFM_MFT1_ICU_ICSA32_ICE2                  *((volatile  uint8_t *)(0x42423110UL))
#define bFM4_MFT1_ICU_ICSA32_ICE2                 *((volatile  uint8_t *)(0x42423110UL))
#define bFM_MFT1_ICU_ICSA32_ICE3                  *((volatile  uint8_t *)(0x42423114UL))
#define bFM4_MFT1_ICU_ICSA32_ICE3                 *((volatile  uint8_t *)(0x42423114UL))
#define bFM_MFT1_ICU_ICSA32_ICP2                  *((volatile  uint8_t *)(0x42423118UL))
#define bFM4_MFT1_ICU_ICSA32_ICP2                 *((volatile  uint8_t *)(0x42423118UL))
#define bFM_MFT1_ICU_ICSA32_ICP3                  *((volatile  uint8_t *)(0x4242311CUL))
#define bFM4_MFT1_ICU_ICSA32_ICP3                 *((volatile  uint8_t *)(0x4242311CUL))

#define bFM_MFT1_ICU_ICSB10_IEI0                  *((volatile  uint8_t *)(0x424230A0UL))
#define bFM4_MFT1_ICU_ICSB10_IEI0                 *((volatile  uint8_t *)(0x424230A0UL))
#define bFM_MFT1_ICU_ICSB10_IEI1                  *((volatile  uint8_t *)(0x424230A4UL))
#define bFM4_MFT1_ICU_ICSB10_IEI1                 *((volatile  uint8_t *)(0x424230A4UL))

#define bFM_MFT1_ICU_ICSB32_IEI2                  *((volatile  uint8_t *)(0x42423120UL))
#define bFM4_MFT1_ICU_ICSB32_IEI2                 *((volatile  uint8_t *)(0x42423120UL))
#define bFM_MFT1_ICU_ICSB32_IEI3                  *((volatile  uint8_t *)(0x42423124UL))
#define bFM4_MFT1_ICU_ICSB32_IEI3                 *((volatile  uint8_t *)(0x42423124UL))

#define bFM_MFT1_OCU_OCSA10_CST0                  *((volatile  uint8_t *)(0x42422300UL))
#define bFM4_MFT1_OCU_OCSA10_CST0                 *((volatile  uint8_t *)(0x42422300UL))
#define bFM_MFT1_OCU_OCSA10_CST1                  *((volatile  uint8_t *)(0x42422304UL))
#define bFM4_MFT1_OCU_OCSA10_CST1                 *((volatile  uint8_t *)(0x42422304UL))
#define bFM_MFT1_OCU_OCSA10_IOE0                  *((volatile  uint8_t *)(0x42422310UL))
#define bFM4_MFT1_OCU_OCSA10_IOE0                 *((volatile  uint8_t *)(0x42422310UL))
#define bFM_MFT1_OCU_OCSA10_IOE1                  *((volatile  uint8_t *)(0x42422314UL))
#define bFM4_MFT1_OCU_OCSA10_IOE1                 *((volatile  uint8_t *)(0x42422314UL))
#define bFM_MFT1_OCU_OCSA10_IOP0                  *((volatile  uint8_t *)(0x42422318UL))
#define bFM4_MFT1_OCU_OCSA10_IOP0                 *((volatile  uint8_t *)(0x42422318UL))
#define bFM_MFT1_OCU_OCSA10_IOP1                  *((volatile  uint8_t *)(0x4242231CUL))
#define bFM4_MFT1_OCU_OCSA10_IOP1                 *((volatile  uint8_t *)(0x4242231CUL))

#define bFM_MFT1_OCU_OCSA32_CST2                  *((volatile  uint8_t *)(0x42422380UL))
#define bFM4_MFT1_OCU_OCSA32_CST2                 *((volatile  uint8_t *)(0x42422380UL))
#define bFM_MFT1_OCU_OCSA32_CST3                  *((volatile  uint8_t *)(0x42422384UL))
#define bFM4_MFT1_OCU_OCSA32_CST3                 *((volatile  uint8_t *)(0x42422384UL))
#define bFM_MFT1_OCU_OCSA32_IOE2                  *((volatile  uint8_t *)(0x42422390UL))
#define bFM4_MFT1_OCU_OCSA32_IOE2                 *((volatile  uint8_t *)(0x42422390UL))
#define bFM_MFT1_OCU_OCSA32_IOE3                  *((volatile  uint8_t *)(0x42422394UL))
#define bFM4_MFT1_OCU_OCSA32_IOE3                 *((volatile  uint8_t *)(0x42422394UL))
#define bFM_MFT1_OCU_OCSA32_IOP2                  *((volatile  uint8_t *)(0x42422398UL))
#define bFM4_MFT1_OCU_OCSA32_IOP2                 *((volatile  uint8_t *)(0x42422398UL))
#define bFM_MFT1_OCU_OCSA32_IOP3                  *((volatile  uint8_t *)(0x4242239CUL))
#define bFM4_MFT1_OCU_OCSA32_IOP3                 *((volatile  uint8_t *)(0x4242239CUL))

